# MetalResistanceCalculationStrength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..MetalResistanceCalculationStrength Property
StructuralAsset Class See Also
---
The resistance calculation strength of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double MetalResistanceCalculationStrength { get; set; }
```

Visual Basic
---
```text
Public Property MetalResistanceCalculationStrength As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MetalResistanceCalculationStrength {
	double get ();
	void set (double value);
}
```

# Remarks
Applies to metal-based structural assets.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | When setting this property: the material type must be Metal to set this property. |

# See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace